Tekla.Structures.Model.ISharingUpdate
Represents an update of data used in sharing operations within the Tekla Structures Model.

Tekla.Structures.Model.ISharingUpdate.Id
Gets the unique identifier of the sharing update.

Tekla.Structures.Model.ISharingUpdate.Type
Gets the type of the sharing update.

Tekla.Structures.Model.ISharingUpdate.Number
Gets the update's packet number.

Tekla.Structures.Model.ISharingUpdate.Code
Gets the code of the sharing update.

Tekla.Structures.Model.ISharingUpdate.Comment
Gets the comment of the sharing update.

Tekla.Structures.Model.ISharingUpdate.CreatedAt
Gets the date and time when the sharing update was created.

Tekla.Structures.Model.ISharingUpdate.CreatedBy
Gets the email of the user who created the sharing update.